zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_CLKCTRL_A_Registers.h
//-----------------------------------------------------------------------------
// Copyright 2012 (c) Silicon Laboratories Inc.
//
// SPDX-License-Identifier: Zlib
//
// This siHAL software is provided 'as-is', without any express or implied
// warranty. In no event will the authors be held liable for any damages
// arising from the use of this software.
//
// Permission is granted to anyone to use this software for any purpose,
// including commercial applications, and to alter it and redistribute it
// freely, subject to the following restrictions:
//
// 1. The origin of this software must not be misrepresented; you must not
//    claim that you wrote the original software. If you use this software
//    in a product, an acknowledgment in the product documentation would be
//    appreciated but is not required.
// 2. Altered source versions must be plainly marked as such, and must not be
//    misrepresented as being the original software.
// 3. This notice may not be removed or altered from any source distribution.
//-----------------------------------------------------------------------------
//
// This file applies to the SIM3L1XX_CLKCTRL_A module
//
// Script: 0.61
// Version: 1

#ifndef __SI32_CLKCTRL_A_REGISTERS_H__
#define __SI32_CLKCTRL_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_CLKCTRL_A_CONTROL_Struct
{
   union
   {
      struct
      {
         // AHB Clock Source Select
         volatile uint32_t AHBSEL: 3;
                  uint32_t reserved0: 5;
         // AHB Clock Divider
         volatile uint32_t AHBDIV: 3;
                  uint32_t reserved1: 5;
         // APB Clock Divider
         volatile uint32_t APBDIV: 1;
                  uint32_t reserved2: 11;
         // External Clock Edge Select
         volatile uint32_t EXTESEL: 1;
         // Oscillators Busy Flag
         volatile uint32_t OBUSYF: 1;
         // VIORF Clock Enable
         volatile uint32_t VIORFCLKEN: 1;
         // External Clock Input Enable
         volatile uint32_t EXTOSCEN: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CLKCTRL_A_CONTROL_AHBSEL_MASK  0x00000007
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_SHIFT  0
// AHB clock source is the Low-Power Oscillator.
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_LPOSC0_VALUE  0
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_LPOSC0_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBSEL_LPOSC0_VALUE << SI32_CLKCTRL_A_CONTROL_AHBSEL_SHIFT)
// AHB clock source is the Low-Frequency Oscillator.
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_LFOSC0_VALUE  1
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_LFOSC0_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBSEL_LFOSC0_VALUE << SI32_CLKCTRL_A_CONTROL_AHBSEL_SHIFT)
// AHB clock source is the RTC0TCLK signal.
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_RTC0TCLK_VALUE  2
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_RTC0TCLK_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBSEL_RTC0TCLK_VALUE << SI32_CLKCTRL_A_CONTROL_AHBSEL_SHIFT)
// AHB clock source is the External Oscillator.
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_EXTOSC0_VALUE  3
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_EXTOSC0_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBSEL_EXTOSC0_VALUE << SI32_CLKCTRL_A_CONTROL_AHBSEL_SHIFT)
// AHB clock source is the VIORFCLK input pin.
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_VIORFCLK_VALUE  4
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_VIORFCLK_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBSEL_VIORFCLK_VALUE << SI32_CLKCTRL_A_CONTROL_AHBSEL_SHIFT)
// AHB clock source is the PLL.
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_PLL0OSC_VALUE  5
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_PLL0OSC_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBSEL_PLL0OSC_VALUE << SI32_CLKCTRL_A_CONTROL_AHBSEL_SHIFT)
// AHB clock source is a divided version of the Low-Power Oscillator.
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_LPOSC0_DIV_VALUE  6
#define SI32_CLKCTRL_A_CONTROL_AHBSEL_LPOSC0_DIV_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBSEL_LPOSC0_DIV_VALUE << SI32_CLKCTRL_A_CONTROL_AHBSEL_SHIFT)

#define SI32_CLKCTRL_A_CONTROL_AHBDIV_MASK  0x00000700
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_SHIFT  8
// AHB clock divided by 1.
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV1_VALUE  0
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV1_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV1_VALUE << SI32_CLKCTRL_A_CONTROL_AHBDIV_SHIFT)
// AHB clock divided by 2.
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV2_VALUE  1
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV2_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV2_VALUE << SI32_CLKCTRL_A_CONTROL_AHBDIV_SHIFT)
// AHB clock divided by 4.
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV4_VALUE  2
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV4_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV4_VALUE << SI32_CLKCTRL_A_CONTROL_AHBDIV_SHIFT)
// AHB clock divided by 8.
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV8_VALUE  3
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV8_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV8_VALUE << SI32_CLKCTRL_A_CONTROL_AHBDIV_SHIFT)
// AHB clock divided by 16.
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV16_VALUE  4
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV16_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV16_VALUE << SI32_CLKCTRL_A_CONTROL_AHBDIV_SHIFT)
// AHB clock divided by 32.
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV32_VALUE  5
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV32_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV32_VALUE << SI32_CLKCTRL_A_CONTROL_AHBDIV_SHIFT)
// AHB clock divided by 64.
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV64_VALUE  6
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV64_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV64_VALUE << SI32_CLKCTRL_A_CONTROL_AHBDIV_SHIFT)
// AHB clock divided by 128.
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV128_VALUE  7
#define SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV128_U32 \
   (SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV128_VALUE << SI32_CLKCTRL_A_CONTROL_AHBDIV_SHIFT)

#define SI32_CLKCTRL_A_CONTROL_APBDIV_MASK  0x00010000
#define SI32_CLKCTRL_A_CONTROL_APBDIV_SHIFT  16
// APB clock is the same as the AHB clock (divided by 1).
#define SI32_CLKCTRL_A_CONTROL_APBDIV_DIV1_VALUE  0
#define SI32_CLKCTRL_A_CONTROL_APBDIV_DIV1_U32 \
   (SI32_CLKCTRL_A_CONTROL_APBDIV_DIV1_VALUE << SI32_CLKCTRL_A_CONTROL_APBDIV_SHIFT)
// APB clock is the AHB clock divided by 2.
#define SI32_CLKCTRL_A_CONTROL_APBDIV_DIV2_VALUE  1
#define SI32_CLKCTRL_A_CONTROL_APBDIV_DIV2_U32 \
   (SI32_CLKCTRL_A_CONTROL_APBDIV_DIV2_VALUE << SI32_CLKCTRL_A_CONTROL_APBDIV_SHIFT)

#define SI32_CLKCTRL_A_CONTROL_EXTESEL_MASK  0x10000000
#define SI32_CLKCTRL_A_CONTROL_EXTESEL_SHIFT  28
// External clock generated by both rising and falling edges of the external
// oscillator.
#define SI32_CLKCTRL_A_CONTROL_EXTESEL_BOTH_EDGES_VALUE  0
#define SI32_CLKCTRL_A_CONTROL_EXTESEL_BOTH_EDGES_U32 \
   (SI32_CLKCTRL_A_CONTROL_EXTESEL_BOTH_EDGES_VALUE << SI32_CLKCTRL_A_CONTROL_EXTESEL_SHIFT)
// External clock generated by only rising edges of the external oscillator.
#define SI32_CLKCTRL_A_CONTROL_EXTESEL_RISING_ONLY_VALUE  1
#define SI32_CLKCTRL_A_CONTROL_EXTESEL_RISING_ONLY_U32 \
   (SI32_CLKCTRL_A_CONTROL_EXTESEL_RISING_ONLY_VALUE << SI32_CLKCTRL_A_CONTROL_EXTESEL_SHIFT)

#define SI32_CLKCTRL_A_CONTROL_OBUSYF_MASK  0x20000000
#define SI32_CLKCTRL_A_CONTROL_OBUSYF_SHIFT  29
// AHB and APB oscillators are not busy.
#define SI32_CLKCTRL_A_CONTROL_OBUSYF_NOT_SET_VALUE  0
#define SI32_CLKCTRL_A_CONTROL_OBUSYF_NOT_SET_U32 \
   (SI32_CLKCTRL_A_CONTROL_OBUSYF_NOT_SET_VALUE << SI32_CLKCTRL_A_CONTROL_OBUSYF_SHIFT)
// AHB and APB oscillators are busy and the AHBSEL, AHBDIV, and APBDIV fields
// should not be modified.
#define SI32_CLKCTRL_A_CONTROL_OBUSYF_SET_VALUE  1
#define SI32_CLKCTRL_A_CONTROL_OBUSYF_SET_U32 \
   (SI32_CLKCTRL_A_CONTROL_OBUSYF_SET_VALUE << SI32_CLKCTRL_A_CONTROL_OBUSYF_SHIFT)

#define SI32_CLKCTRL_A_CONTROL_VIORFCLKEN_MASK  0x40000000
#define SI32_CLKCTRL_A_CONTROL_VIORFCLKEN_SHIFT  30
// Disable the VIORFCLK input.
#define SI32_CLKCTRL_A_CONTROL_VIORFCLKEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_CONTROL_VIORFCLKEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_CONTROL_VIORFCLKEN_DISABLED_VALUE << SI32_CLKCTRL_A_CONTROL_VIORFCLKEN_SHIFT)
// Enable the VIORFCLK input.
#define SI32_CLKCTRL_A_CONTROL_VIORFCLKEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_CONTROL_VIORFCLKEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_CONTROL_VIORFCLKEN_ENABLED_VALUE << SI32_CLKCTRL_A_CONTROL_VIORFCLKEN_SHIFT)

#define SI32_CLKCTRL_A_CONTROL_EXTOSCEN_MASK  0x80000000
#define SI32_CLKCTRL_A_CONTROL_EXTOSCEN_SHIFT  31
// Disable the EXTOSC input.
#define SI32_CLKCTRL_A_CONTROL_EXTOSCEN_DISABLED_VALUE  0U
#define SI32_CLKCTRL_A_CONTROL_EXTOSCEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_CONTROL_EXTOSCEN_DISABLED_VALUE << SI32_CLKCTRL_A_CONTROL_EXTOSCEN_SHIFT)
// Enable the EXTOSC input.
#define SI32_CLKCTRL_A_CONTROL_EXTOSCEN_ENABLED_VALUE  1U
#define SI32_CLKCTRL_A_CONTROL_EXTOSCEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_CONTROL_EXTOSCEN_ENABLED_VALUE << SI32_CLKCTRL_A_CONTROL_EXTOSCEN_SHIFT)



struct SI32_CLKCTRL_A_AHBCLKG_Struct
{
   union
   {
      struct
      {
         // RAM Clock Enable
         volatile uint32_t RAMCEN: 1;
         // DMA Clock Enable
         volatile uint32_t DMACEN: 1;
         // Flash Clock Enable
         volatile uint32_t FLASHCEN: 1;
         // DTM0 Clock Enable
         volatile uint32_t DTM0EN: 1;
         // DTM1 Clock Enable
         volatile uint32_t DTM1EN: 1;
         // DTM2 Clock Enable
         volatile uint32_t DTM2EN: 1;
                  uint32_t reserved0: 26;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CLKCTRL_A_AHBCLKG_RAMCEN_MASK  0x00000001
#define SI32_CLKCTRL_A_AHBCLKG_RAMCEN_SHIFT  0
// Disable the AHB clock to the RAM.
#define SI32_CLKCTRL_A_AHBCLKG_RAMCEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_AHBCLKG_RAMCEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_RAMCEN_DISABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_RAMCEN_SHIFT)
// Enable the AHB clock to the RAM.
#define SI32_CLKCTRL_A_AHBCLKG_RAMCEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_AHBCLKG_RAMCEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_RAMCEN_ENABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_RAMCEN_SHIFT)

