zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_CLKCTRL_A_Registers.h
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_MASK  0x00000002
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_SHIFT  1
// Disable the AHB clock to the DMA Controller.
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_DMACEN_DISABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_DMACEN_SHIFT)
// Enable the AHB clock to the DMA Controller.
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_AHBCLKG_DMACEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_DMACEN_ENABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_DMACEN_SHIFT)

#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_MASK  0x00000004
#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_SHIFT  2
// Disable the AHB clock to the Flash.
#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_DISABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_SHIFT)
// Enable the AHB clock to the Flash.
#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_ENABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_FLASHCEN_SHIFT)

#define SI32_CLKCTRL_A_AHBCLKG_DTM0EN_MASK  0x00000008
#define SI32_CLKCTRL_A_AHBCLKG_DTM0EN_SHIFT  3
// Disable the AHB clock to Data Transfer Manager 0 (DTM0).
#define SI32_CLKCTRL_A_AHBCLKG_DTM0EN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_AHBCLKG_DTM0EN_DISABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_DTM0EN_DISABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_DTM0EN_SHIFT)
// Enable the AHB clock to Data Transfer Manager 0 (DTM0).
#define SI32_CLKCTRL_A_AHBCLKG_DTM0EN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_AHBCLKG_DTM0EN_ENABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_DTM0EN_ENABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_DTM0EN_SHIFT)

#define SI32_CLKCTRL_A_AHBCLKG_DTM1EN_MASK  0x00000010
#define SI32_CLKCTRL_A_AHBCLKG_DTM1EN_SHIFT  4
// Disable the AHB clock to Data Transfer Manager 1 (DTM1).
#define SI32_CLKCTRL_A_AHBCLKG_DTM1EN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_AHBCLKG_DTM1EN_DISABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_DTM1EN_DISABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_DTM1EN_SHIFT)
// Enable the AHB clock to Data Transfer Manager 1 (DTM1).
#define SI32_CLKCTRL_A_AHBCLKG_DTM1EN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_AHBCLKG_DTM1EN_ENABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_DTM1EN_ENABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_DTM1EN_SHIFT)

#define SI32_CLKCTRL_A_AHBCLKG_DTM2EN_MASK  0x00000020
#define SI32_CLKCTRL_A_AHBCLKG_DTM2EN_SHIFT  5
// Disable the AHB clock to Data Transfer Manager 2 (DTM2).
#define SI32_CLKCTRL_A_AHBCLKG_DTM2EN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_AHBCLKG_DTM2EN_DISABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_DTM2EN_DISABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_DTM2EN_SHIFT)
// Enable the AHB clock to Data Transfer Manager 2 (DTM2).
#define SI32_CLKCTRL_A_AHBCLKG_DTM2EN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_AHBCLKG_DTM2EN_ENABLED_U32 \
   (SI32_CLKCTRL_A_AHBCLKG_DTM2EN_ENABLED_VALUE << SI32_CLKCTRL_A_AHBCLKG_DTM2EN_SHIFT)



struct SI32_CLKCTRL_A_APBCLKG0_Struct
{
   union
   {
      struct
      {
         // Flash Controller Clock Enable
         volatile uint32_t FLCTRLCEN: 1;
         // Port Bank Clock Enable
         volatile uint32_t PB0CEN: 1;
         // USART0 Clock Enable
         volatile uint32_t USART0CEN: 1;
         // UART0 Clock Enable
         volatile uint32_t UART0CEN: 1;
         // SPI0 Clock Enable
         volatile uint32_t SPI0CEN: 1;
         // SPI1 Clock Enable
         volatile uint32_t SPI1CEN: 1;
         // I2C0 Clock Enable
         volatile uint32_t I2C0CEN: 1;
         // EPCA0 Clock Enable
         volatile uint32_t EPCA0CEN: 1;
         // TIMER0 Clock Enable
         volatile uint32_t TIMER0CEN: 1;
         // TIMER1 Clock Enable
         volatile uint32_t TIMER1CEN: 1;
         // TIMER2 Clock Enable
         volatile uint32_t TIMER2CEN: 1;
         // SARADC0 Clock Enable
         volatile uint32_t ADC0CEN: 1;
         // CMP0 Clock Enable
         volatile uint32_t CMP0CEN: 1;
         // CMP1 Clock Enable
         volatile uint32_t CMP1CEN: 1;
         // AES0 Clock Enable
         volatile uint32_t AES0CEN: 1;
         // CRC0 Clock Enable
         volatile uint32_t CRC0CEN: 1;
         // IDAC0 Clock Enable
         volatile uint32_t IDAC0CEN: 1;
         // LPT0 Clock Enable
         volatile uint32_t LPT0CEN: 1;
         // ACCTR0 Enable
         volatile uint32_t ACCTR0CEN: 1;
         // DTM0 Clock Enable
         volatile uint32_t DTM0CEN: 1;
         // DTM1 Clock Enable
         volatile uint32_t DTM1CEN: 1;
         // DTM2 Clock Enable
         volatile uint32_t DTM2CEN: 1;
         // LCD0 Clock Enable
         volatile uint32_t LCD0CEN: 1;
         // DCDC0 Clock Enable
         volatile uint32_t DCDC0CEN: 1;
         // ENCDEC0 Clock Enable
         volatile uint32_t ENCDEC0CEN: 1;
         // PLL0 Clock Enable
         volatile uint32_t PLL0CEN: 1;
                  uint32_t reserved0: 6;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CLKCTRL_A_APBCLKG0_FLCTRLCEN_MASK  0x00000001
#define SI32_CLKCTRL_A_APBCLKG0_FLCTRLCEN_SHIFT  0
// Disable the APB clock to the Flash Controller Module (FLASHCTRL0).
#define SI32_CLKCTRL_A_APBCLKG0_FLCTRLCEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_FLCTRLCEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_FLCTRLCEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_FLCTRLCEN_SHIFT)
// Enable the APB clock to the Flash Controller Module (FLASHCTRL0).
#define SI32_CLKCTRL_A_APBCLKG0_FLCTRLCEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_FLCTRLCEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_FLCTRLCEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_FLCTRLCEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_MASK  0x00000002
#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_SHIFT  1
// Disable the APB clock to the Port Bank Modules.
#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PB0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PB0CEN_SHIFT)
// Enable the APB clock to the Port Bank Modules.
#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_PB0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PB0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PB0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_MASK  0x00000004
#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_SHIFT  2
// Disable the APB clock to the USART0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_USART0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_USART0CEN_SHIFT)
// Enable the APB clock to the USART0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_USART0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_USART0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_USART0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_MASK  0x00000008
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_SHIFT  3
// Disable the APB clock to the UART0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_UART0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_UART0CEN_SHIFT)
// Enable the APB clock to the UART0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_UART0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_UART0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_UART0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_MASK  0x00000010
#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_SHIFT  4
// Disable the APB clock to the SPI0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_SHIFT)
// Enable the APB clock to the SPI0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SPI0CEN_SHIFT)

