zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_CLKCTRL_A_Registers.h
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_MASK  0x00000020
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_SHIFT  5
// Disable the APB clock to the SPI1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_SHIFT)
// Enable the APB clock to the SPI1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_SPI1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_MASK  0x00000040
#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_SHIFT  6
// Disable the APB clock to the I2C0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_SHIFT)
// Enable the APB clock to the I2C0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_I2C0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_MASK  0x00000080
#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_SHIFT  7
// Disable the APB clock to the EPCA0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_SHIFT)
// Enable the APB clock to the EPCA0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_EPCA0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_MASK  0x00000100
#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_SHIFT  8
// Disable the APB clock to the TIMER0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_SHIFT)
// Enable the APB clock to the TIMER0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_MASK  0x00000200
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_SHIFT  9
// Disable the APB clock to the TIMER1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_SHIFT)
// Enable the APB clock to the TIMER1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_TIMER2CEN_MASK  0x00000400
#define SI32_CLKCTRL_A_APBCLKG0_TIMER2CEN_SHIFT  10
// Disable the APB clock to the TIMER2 Module.
#define SI32_CLKCTRL_A_APBCLKG0_TIMER2CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_TIMER2CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_TIMER2CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_TIMER2CEN_SHIFT)
// Enable the APB clock to the TIMER2 Module.
#define SI32_CLKCTRL_A_APBCLKG0_TIMER2CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_TIMER2CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_TIMER2CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_TIMER2CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_MASK  0x00000800
#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_SHIFT  11
// Disable the APB clock to the SARADC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_SHIFT)
// Enable the APB clock to the SARADC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_ADC0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_MASK  0x00001000
#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_SHIFT  12
// Disable the APB clock to the Comparator 0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_SHIFT)
// Enable the APB clock to the Comparator 0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CMP0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_MASK  0x00002000
#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_SHIFT  13
// Disable the APB clock to the Comparator 1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_SHIFT)
// Enable the APB clock to the Comparator 1 Module.
#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CMP1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_MASK  0x00004000
#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_SHIFT  14
// Disable the APB clock to the AES0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_AES0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_AES0CEN_SHIFT)
// Enable the APB clock to the AES0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_AES0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_AES0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_AES0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_MASK  0x00008000
#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_SHIFT  15
// Disable the APB clock to the CRC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_SHIFT)
// Enable the APB clock to the CRC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_CRC0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_MASK  0x00010000
#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_SHIFT  16
// Disable the APB clock to the IDAC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_SHIFT)
// Enable the APB clock to the IDAC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_IDAC0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_MASK  0x00020000
#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_SHIFT  17
// Disable the APB clock to the LPTIMER0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_SHIFT)
// Enable the APB clock to the LPTIMER0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_LPT0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_ACCTR0CEN_MASK  0x00040000
#define SI32_CLKCTRL_A_APBCLKG0_ACCTR0CEN_SHIFT  18
// Disable the APB clock to the ACCTR0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_ACCTR0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_ACCTR0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_ACCTR0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_ACCTR0CEN_SHIFT)
// Enable the APB clock to the ACCTR0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_ACCTR0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_ACCTR0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_ACCTR0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_ACCTR0CEN_SHIFT)

