zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_CLKCTRL_A_Registers.h
#define SI32_CLKCTRL_A_APBCLKG0_DTM0CEN_MASK  0x00080000
#define SI32_CLKCTRL_A_APBCLKG0_DTM0CEN_SHIFT  19
// Disable the APB clock to the DTM0 Register interface.
#define SI32_CLKCTRL_A_APBCLKG0_DTM0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_DTM0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_DTM0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_DTM0CEN_SHIFT)
// Enable the APB clock to the DTM0 Register interface.
#define SI32_CLKCTRL_A_APBCLKG0_DTM0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_DTM0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_DTM0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_DTM0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_DTM1CEN_MASK  0x00100000
#define SI32_CLKCTRL_A_APBCLKG0_DTM1CEN_SHIFT  20
// Disable the APB clock to the DTM1 Register interface.
#define SI32_CLKCTRL_A_APBCLKG0_DTM1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_DTM1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_DTM1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_DTM1CEN_SHIFT)
// Enable the APB clock to the DTM1 Register interface.
#define SI32_CLKCTRL_A_APBCLKG0_DTM1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_DTM1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_DTM1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_DTM1CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_DTM2CEN_MASK  0x00200000
#define SI32_CLKCTRL_A_APBCLKG0_DTM2CEN_SHIFT  21
// Disable the APB clock to the DTM2 Register interface.
#define SI32_CLKCTRL_A_APBCLKG0_DTM2CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_DTM2CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_DTM2CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_DTM2CEN_SHIFT)
// Enable the APB clock to the DTM2 Register interface.
#define SI32_CLKCTRL_A_APBCLKG0_DTM2CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_DTM2CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_DTM2CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_DTM2CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_LCD0CEN_MASK  0x00400000
#define SI32_CLKCTRL_A_APBCLKG0_LCD0CEN_SHIFT  22
// Disable the APB clock to the LCD0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_LCD0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_LCD0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_LCD0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_LCD0CEN_SHIFT)
// Enable the APB clock to the LCD0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_LCD0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_LCD0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_LCD0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_LCD0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_DCDC0CEN_MASK  0x00800000
#define SI32_CLKCTRL_A_APBCLKG0_DCDC0CEN_SHIFT  23
// Disable the APB clock to the DCDC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_DCDC0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_DCDC0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_DCDC0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_DCDC0CEN_SHIFT)
// Enable the APB clock to the DCDC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_DCDC0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_DCDC0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_DCDC0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_DCDC0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_ENCDEC0CEN_MASK  0x01000000
#define SI32_CLKCTRL_A_APBCLKG0_ENCDEC0CEN_SHIFT  24
// Disable the APB clock to the ENCDEC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_ENCDEC0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_ENCDEC0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_ENCDEC0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_ENCDEC0CEN_SHIFT)
// Enable the APB clock to the ENCDEC0 Module.
#define SI32_CLKCTRL_A_APBCLKG0_ENCDEC0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_ENCDEC0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_ENCDEC0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_ENCDEC0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_MASK  0x02000000
#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_SHIFT  25
// Disable the APB clock to the PLL0 registers.
#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_SHIFT)
// Enable the APB clock to the PLL0 registers.
#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG0_PLL0CEN_SHIFT)



struct SI32_CLKCTRL_A_APBCLKG1_Struct
{
   union
   {
      struct
      {
         // Miscellaneous 0 Clock Enable
         volatile uint32_t MISC0CEN: 1;
         // Miscellaneous 1 Clock Enable
         volatile uint32_t MISC1CEN: 1;
                  uint32_t reserved0: 30;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CLKCTRL_A_APBCLKG1_MISC0CEN_MASK  0x00000001
#define SI32_CLKCTRL_A_APBCLKG1_MISC0CEN_SHIFT  0
// Disable the APB clock to the VMON0, LDO0, EXTOSC0, LPOSC0, RTC0 and RSTSRC
// modules.
#define SI32_CLKCTRL_A_APBCLKG1_MISC0CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG1_MISC0CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG1_MISC0CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG1_MISC0CEN_SHIFT)
// Enable the APB clock to the VMON0, LDO0, EXTOSC0, LPOSC0, RTC0 and RSTSRC
// modules.
#define SI32_CLKCTRL_A_APBCLKG1_MISC0CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG1_MISC0CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG1_MISC0CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG1_MISC0CEN_SHIFT)

#define SI32_CLKCTRL_A_APBCLKG1_MISC1CEN_MASK  0x00000002
#define SI32_CLKCTRL_A_APBCLKG1_MISC1CEN_SHIFT  1
// Disable the APB clock to the  Watchdog Timer (WDTIMER0) and DMA Crossbar
// (DMAXBAR0) modules.
#define SI32_CLKCTRL_A_APBCLKG1_MISC1CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_APBCLKG1_MISC1CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG1_MISC1CEN_DISABLED_VALUE << SI32_CLKCTRL_A_APBCLKG1_MISC1CEN_SHIFT)
// Enable the APB clock to the  Watchdog Timer (WDTIMER0) and DMA Crossbar
// (DMAXBAR0) modules.
#define SI32_CLKCTRL_A_APBCLKG1_MISC1CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_APBCLKG1_MISC1CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_APBCLKG1_MISC1CEN_ENABLED_VALUE << SI32_CLKCTRL_A_APBCLKG1_MISC1CEN_SHIFT)



struct SI32_CLKCTRL_A_PM3CN_Struct
{
   union
   {
      struct
      {
         // Power Mode 3 Fast-Wake Clock Source
         volatile uint32_t PM3CSEL: 3;
                  uint32_t reserved0: 13;
         // Power Mode 3 Fast-Wake Clock Enable
         volatile uint32_t PM3CEN: 1;
                  uint32_t reserved1: 15;
      };
      volatile uint32_t U32;
   };
};

#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_MASK  0x00000007
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_SHIFT  0
// Power Mode 3 clock source is the Low-Power Oscillator.
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_LPOSC0_VALUE  0
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_LPOSC0_U32 \
   (SI32_CLKCTRL_A_PM3CN_PM3CSEL_LPOSC0_VALUE << SI32_CLKCTRL_A_PM3CN_PM3CSEL_SHIFT)
// Power Mode 3 clock source is the Low-Frequency Oscillator.
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_LFOSC0_VALUE  1
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_LFOSC0_U32 \
   (SI32_CLKCTRL_A_PM3CN_PM3CSEL_LFOSC0_VALUE << SI32_CLKCTRL_A_PM3CN_PM3CSEL_SHIFT)
// Power Mode 3 clock source is the RTC0TCLK signal.
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_RTC0TCLK_VALUE  2
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_RTC0TCLK_U32 \
   (SI32_CLKCTRL_A_PM3CN_PM3CSEL_RTC0TCLK_VALUE << SI32_CLKCTRL_A_PM3CN_PM3CSEL_SHIFT)
// Power Mode 3 clock source is the External Oscillator.
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_EXTOSC0_VALUE  3
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_EXTOSC0_U32 \
   (SI32_CLKCTRL_A_PM3CN_PM3CSEL_EXTOSC0_VALUE << SI32_CLKCTRL_A_PM3CN_PM3CSEL_SHIFT)
// Power Mode 3 clock source is the VIORFCLK input pin.
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_VIORFCLK_VALUE  4
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_VIORFCLK_U32 \
   (SI32_CLKCTRL_A_PM3CN_PM3CSEL_VIORFCLK_VALUE << SI32_CLKCTRL_A_PM3CN_PM3CSEL_SHIFT)
// Power Mode 3 clock source is the PLL.
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_PLL0OSC_VALUE  5
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_PLL0OSC_U32 \
   (SI32_CLKCTRL_A_PM3CN_PM3CSEL_PLL0OSC_VALUE << SI32_CLKCTRL_A_PM3CN_PM3CSEL_SHIFT)
// Power Mode 3 clock source is a divided version of the Low-Power Oscillator.
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_LPOSC0_DIV_VALUE  6
#define SI32_CLKCTRL_A_PM3CN_PM3CSEL_LPOSC0_DIV_U32 \
   (SI32_CLKCTRL_A_PM3CN_PM3CSEL_LPOSC0_DIV_VALUE << SI32_CLKCTRL_A_PM3CN_PM3CSEL_SHIFT)

#define SI32_CLKCTRL_A_PM3CN_PM3CEN_MASK  0x00010000
#define SI32_CLKCTRL_A_PM3CN_PM3CEN_SHIFT  16
// Disable the core clock when in Power Mode 3.
#define SI32_CLKCTRL_A_PM3CN_PM3CEN_DISABLED_VALUE  0
#define SI32_CLKCTRL_A_PM3CN_PM3CEN_DISABLED_U32 \
   (SI32_CLKCTRL_A_PM3CN_PM3CEN_DISABLED_VALUE << SI32_CLKCTRL_A_PM3CN_PM3CEN_SHIFT)
// The core clock is enabled and runs off the clock selected by PM3CSEL in Power
// Mode 3.
#define SI32_CLKCTRL_A_PM3CN_PM3CEN_ENABLED_VALUE  1
#define SI32_CLKCTRL_A_PM3CN_PM3CEN_ENABLED_U32 \
   (SI32_CLKCTRL_A_PM3CN_PM3CEN_ENABLED_VALUE << SI32_CLKCTRL_A_PM3CN_PM3CEN_SHIFT)



struct SI32_CLKCTRL_A_CONFIG_Struct
{
   union
   {
      struct
      {
         // Power Mode Select
         volatile uint32_t PMSEL: 1;
                  uint32_t reserved0: 31;
      };
      volatile uint32_t U32;
   };
};

