zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_CLKCTRL_A_Registers.h
#define SI32_CLKCTRL_A_CONFIG_PMSEL_MASK  0x00000001
#define SI32_CLKCTRL_A_CONFIG_PMSEL_SHIFT  0
// Power Mode < PM8.
#define SI32_CLKCTRL_A_CONFIG_PMSEL_PM8_DIS_VALUE  0
#define SI32_CLKCTRL_A_CONFIG_PMSEL_PM8_DIS_U32 \
   (SI32_CLKCTRL_A_CONFIG_PMSEL_PM8_DIS_VALUE << SI32_CLKCTRL_A_CONFIG_PMSEL_SHIFT)
// Power Mode = PM8.
#define SI32_CLKCTRL_A_CONFIG_PMSEL_PM8_EN_VALUE  1
#define SI32_CLKCTRL_A_CONFIG_PMSEL_PM8_EN_U32 \
   (SI32_CLKCTRL_A_CONFIG_PMSEL_PM8_EN_VALUE << SI32_CLKCTRL_A_CONFIG_PMSEL_SHIFT)



typedef struct SI32_CLKCTRL_A_Struct
{
   struct SI32_CLKCTRL_A_CONTROL_Struct            CONTROL        ; // Base Address + 0x0
   uint32_t                                        reserved0;
   uint32_t                                        reserved1;
   uint32_t                                        reserved2;
   struct SI32_CLKCTRL_A_AHBCLKG_Struct            AHBCLKG        ; // Base Address + 0x10
   volatile uint32_t                               AHBCLKG_SET;
   volatile uint32_t                               AHBCLKG_CLR;
   uint32_t                                        reserved3;
   struct SI32_CLKCTRL_A_APBCLKG0_Struct           APBCLKG0       ; // Base Address + 0x20
   volatile uint32_t                               APBCLKG0_SET;
   volatile uint32_t                               APBCLKG0_CLR;
   uint32_t                                        reserved4;
   struct SI32_CLKCTRL_A_APBCLKG1_Struct           APBCLKG1       ; // Base Address + 0x30
   volatile uint32_t                               APBCLKG1_SET;
   volatile uint32_t                               APBCLKG1_CLR;
   uint32_t                                        reserved5;
   struct SI32_CLKCTRL_A_PM3CN_Struct              PM3CN          ; // Base Address + 0x40
   uint32_t                                        reserved6;
   uint32_t                                        reserved7;
   uint32_t                                        reserved8;
   uint32_t                                        reserved9[4];
   struct SI32_CLKCTRL_A_CONFIG_Struct             CONFIG         ; // Base Address + 0x60
   volatile uint32_t                               CONFIG_SET;
   volatile uint32_t                               CONFIG_CLR;
   uint32_t                                        reserved10;
   uint32_t                                        reserved11[4];
} SI32_CLKCTRL_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_CLKCTRL_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

